In [1]:
import numpy as np
import pandas as pd

In [7]:
data1 = pd.read_csv('orders.csv')
data2 = pd.read_csv('messages.csv')
data1.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [8]:
data2.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [9]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [11]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

 # Working with Dates

In [13]:
# Converting to datetime datatype
data1['date'] = pd.to_datetime(data1['date'])

In [14]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

# 1. Extract year

In [15]:
data1['year'] = data1['date'].dt.year

data1.sample(5)

          date  product_id  city_id  orders  year
468 2019-02-14        7140       18      20  2019
750 2018-09-18        6430       13       2  2018
296 2018-12-05        3601        9       2  2018
362 2019-10-10        3734        4      25  2019
738 2019-05-27        7585       27       2  2019

# 2. Extract Month

In [17]:

data1['month'] = data1['date'].dt.month

data1.head()

        date  product_id  city_id  orders  year  month
0 2019-12-10        5628       25       3  2019     12
1 2018-08-15        3646       14     157  2018      8
2 2018-10-23        1859       25       1  2018     10
3 2019-08-17        7292       25       1  2019      8
4 2019-01-06        4344       25       3  2019      1

In [22]:
data1['month_name'] = data1['date'].dt.month_name()

data1.head()

        date  product_id  city_id  orders  year  month month_name
0 2019-12-10        5628       25       3  2019     12   December
1 2018-08-15        3646       14     157  2018      8     August
2 2018-10-23        1859       25       1  2018     10    October
3 2019-08-17        7292       25       1  2019      8     August
4 2019-01-06        4344       25       3  2019      1    January

# Extract Days

In [25]:

data1['day'] = data1['date'].dt.day

data1.head()

        date  product_id  city_id  orders  year  month month_name  day
0 2019-12-10        5628       25       3  2019     12   December   10
1 2018-08-15        3646       14     157  2018      8     August   15
2 2018-10-23        1859       25       1  2018     10    October   23
3 2019-08-17        7292       25       1  2019      8     August   17
4 2019-01-06        4344       25       3  2019      1    January    6

In [27]:
# day of week
data1['day_name'] = data1['date'].dt.dayofweek

data1.head()

,date,product_id,city_id,orders,year,month,month_name,day,day_name
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [31]:
# day of week - name

data1['day_name'] = data1['date'].dt.day_name()

data1.drop(columns=['product_id','city_id','orders']).head()

        date  year  month month_name  day   day_name
0 2019-12-10  2019     12   December   10    Tuesday
1 2018-08-15  2018      8     August   15  Wednesday
2 2018-10-23  2018     10    October   23    Tuesday
3 2019-08-17  2019      8     August   17   Saturday
4 2019-01-06  2019      1    January    6     Sunday

In [32]:
# is weekend?

data1['is_weekend'] = np.where(data1['day_name'].isin(['Sunday', 'Saturday']), 1,0)

In [33]:
data1.head()

,date,product_id,city_id,orders,year,month,month_name,day,day_name,is_weekend
0,2019-12-10,5628,25,3,2019,12,December,10,Tuesday,0
1,2018-08-15,3646,14,157,2018,8,August,15,Wednesday,0
2,2018-10-23,1859,25,1,2018,10,October,23,Tuesday,0
3,2019-08-17,7292,25,1,2019,8,August,17,Saturday,1
4,2019-01-06,4344,25,3,2019,1,January,6,Sunday,1

In [36]:
# Extract week of the year
data1['date_week'] = data1['date'].dt.isocalendar().week
data1.head()

,date,product_id,city_id,orders,year,month,month_name,day,day_name,is_weekend,date_week
0,2019-12-10,5628,25,3,2019,12,December,10,Tuesday,0,50
1,2018-08-15,3646,14,157,2018,8,August,15,Wednesday,0,33
2,2018-10-23,1859,25,1,2018,10,October,23,Tuesday,0,43
3,2019-08-17,7292,25,1,2019,8,August,17,Saturday,1,33
4,2019-01-06,4344,25,3,2019,1,January,6,Sunday,1,1

In [37]:
data1['quarter'] = data1['date'].dt.quarter
data1.head()

,date,product_id,city_id,orders,year,month,month_name,day,day_name,is_weekend,date_week,quarter
0,2019-12-10,5628,25,3,2019,12,December,10,Tuesday,0,50,4
1,2018-08-15,3646,14,157,2018,8,August,15,Wednesday,0,33,3
2,2018-10-23,1859,25,1,2018,10,October,23,Tuesday,0,43,4
3,2019-08-17,7292,25,1,2019,8,August,17,Saturday,1,33,3
4,2019-01-06,4344,25,3,2019,1,January,6,Sunday,1,1,1

In [39]:
# Extract Semester
data1['semester'] = np.where(data1['quarter'].isin([1,2]), 1, 2)
data1.head()

,date,product_id,city_id,orders,year,month,month_name,day,day_name,is_weekend,date_week,quarter,semester
0,2019-12-10,5628,25,3,2019,12,December,10,Tuesday,0,50,4,2
1,2018-08-15,3646,14,157,2018,8,August,15,Wednesday,0,33,3,2
2,2018-10-23,1859,25,1,2018,10,October,23,Tuesday,0,43,4,2
3,2019-08-17,7292,25,1,2019,8,August,17,Saturday,1,33,3,2
4,2019-01-06,4344,25,3,2019,1,January,6,Sunday,1,1,1,1

**Extract Time elapsed between dates**

In [40]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2026, 2, 23, 20, 2, 23, 905778)

In [41]:
today - data1['date']

0     2267 days 20:02:23.905778
1     2749 days 20:02:23.905778
2     2680 days 20:02:23.905778
3     2382 days 20:02:23.905778
4     2605 days 20:02:23.905778
                 ...
995   2695 days 20:02:23.905778
996   2636 days 20:02:23.905778
997   2484 days 20:02:23.905778
998   2549 days 20:02:23.905778
999   2323 days 20:02:23.905778
Name: date, Length: 1000, dtype: timedelta64[ns]

In [42]:
(today - data1['date']).dt.days

0      2267
1      2749
2      2680
3      2382
4      2605
       ...
995    2695
996    2636
997    2484
998    2549
999    2323
Name: date, Length: 1000, dtype: int64

# Working with Times

In [43]:
# Converting to datetime datatype
data2['date'] = pd.to_datetime(data2['date'])
data2.head()

                 date                                                msg
0 2013-12-15 00:50:00                           ищу на сегодня мужика 37
1 2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2 2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3 2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4 2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [44]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [45]:
data2['hour'] = data2['date'].dt.hour 
data2['min'] = data2['date'].dt.minute
data2['sec'] = data2['date'].dt.second

data2.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [46]:
# Extract Time part
data2['time'] = data2['date'].dt.time

data2.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [48]:
# Time difference
today - data2['date']

0     4453 days 19:12:23.905778
1     4317 days 20:22:23.905778
2     4803 days 19:41:23.905778
3     4105 days 19:31:23.905778
4     4502 days 20:51:23.905778
                 ...
995   5092 days 19:12:23.905778
996   4413 days 20:48:23.905778
997   4878 days 20:25:23.905778
998   4994 days 20:28:23.905778
999   4266 days 20:37:23.905778
Name: date, Length: 1000, dtype: timedelta64[ns]